/*
Многострочный комментарий:
Здесь может быть добавлен любой текст
 */

/**
 * Текст из это раздела будет использоваться для документирования кода программы.
 * С помощью утилиты javadoc происходит генерация документации.
 * Существуеют определенные дескрипторы начинающиеся с @.
 */

package com.javaguru.student_sergey_kazyanin.lesson_2.level_x;

public class Super_Task_5 {

    public static void main(String[] args){
//  Однострочный комментарий
        int x = 0; //x - целочисленная переменная

//   Вывод переменной Х в консоль
        System.out.println(x);
    }
}
