/*
        Учимся работать со строками.

        Тема: создание переменной типа String.

        Напишите программу в которой создайте переменную
        типа String и присвойте ей в качестве начального значения
        ваше имя. Выведете на консоль значение этой переменной.

        Пример кода:

        String myName = "Viktor";
        System.out.println(myName);

*/
package com.javaguru.student_sergey_kazyanin.lesson_3.level_2;

class Task_7 {
    public static void main(String[] args) {

        String myName = "Sergey";
        System.out.println(myName);
    }

}
