package com.javaguru.student_vladimir_petranovski.lesson_3.level_1.task_3;
/*
Создайте отдельный класс RobotDemo для демонстрации
работы с классом Robot.

Внутри класса RobotDemo создайте метод

    public static void main(String[] args) {
        // создайте экземпляр класса Robot вызвав конструктор класса
        // сохраните ссылку (указатель) на только, что созданный
        // виртуальный обьект класса Robot в переменную,
        // она нам понадобиться для дальнейшего использования.
    }
 */

public class Robot {
    public Robot() {

    } // можно было и не писать пустой конструктор, он бы создался по умолчанию
}
