package com.javaguru.student_vladimir_petranovski.lesson_3.level_2;
/*
Учимся работать со строками.

Тема: создание переменной типа String.

Напишите программу в которой создайте переменную
типа String и присвойте ей в качестве начального значения
ваше имя. Выведете на консоль значение этой переменной.

Пример кода:

    String myName = "Viktor";
    System.out.println(myName);

 */

public class TaskSevenString {
    public static void main(String[] args) {
        String myName = "Vladimir";
        System.out.println(myName);
    }
}
