/*
Учимся работать со строками.

Тема: создание переменной типа String.

Напишите программу в которой создайте переменную
типа String и присвойте ей в качестве начального значения
ваше имя. Выведете на консоль значение этой переменной.

Пример кода:

    String myName = "Viktor";
    System.out.println(myName);
 */
package lesson_3.level_2;

public class TaskSeven {
    public static void main(String[] args) {
        String myName = "Denis";
        System.out.println(myName);
    }

}
