package com.javaguru.student_vadim_migun.lesson_3.level_1;

/*
Создайте класс робот (Robot).

Научите вашего робота "говорить" привет.

Создайте в классе Robot метод со следующей сигнатурой:

    public void sayHello() {
        // тут напишите команду распечатки на консоли строки "Hello!"
    }

 */

 class Robot {

     private String name;

     public Robot () {
     }


    public void sayHello() {
        System.out.println("Hello!");

    }
    public void sayYourName() {
        System.out.println("My name is ROBO1");
    }

    public void sayYourName2() {
        System.out.println("My name is ROBO2");

    }

}
