package com.javaguru.student_vadim_migun.lesson_3.level_2;

// Task_7 - Task_8

/*
Учимся работать со строками.

Тема: создание переменной типа String.

Напишите программу в которой создайте переменную
типа String и присвойте ей в качестве начального значения
ваше имя. Выведете на консоль значение этой переменной.
 */

class MyName {
    public static void main(String[] args) {
        String myName = "Vadim";
        System.out.println("Hi " + myName);
    }
}
